app/controllers/users_controller.rb

  def login

    if params[:login].present?

      user = User.authenticate(params[:username],params[:password])
      notice = ""

      if !user.blank?
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'afzal' LIMIT 1